Revit 2027 API
DividedPath.GetIntersectingElements Method
 Get the elements whose intersection with path produces points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetIntersectingElements()
Public Function GetIntersectingElements As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetIntersectingElements()
member GetIntersectingElements : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace